packages/helpers/woc-api/test/perf_test/2024-07-23_19-49-17.282871/woc_get_addressbalance_1000rps_singleEndpoint.yml
execution:
  - executor: locust
    concurrency: 100  # A smaller number to start with
    throughput: 10000000  # A smaller throughput to start with
    hold-for: 50s  # Short duration for quick tests
    ramp-up: 1s  # Ramp-up time
    scenario: get-requests

scenarios:
  get-requests:
    timeout: 5s
    requests:
      - url: https://api-ovh.whatsonchain.com/v1/bsv/main/address/18VWHjMt4ixHddPPbs6righWTs3Sg2QNcn/balance
        method: GET
        headers:
          Accept: "application/json"
          Authorization: "mainnet_2975d2afeb0b46f9e249f035949e700a"

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: reports-junit-format.xml
    data-source: sample-labels

modules:
  locust:
    cmdline: